---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
StructuralElementDefinitionData Properties
StructuralElementDefinitionData Class See Also Send Feedback
---

The StructuralElementDefinitionData type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CenterCurve | The curve lying in the geometrical center of the element. |
|  | Curve | The definition curve of the element. |
|  | EndShortening | Cutback or extension at element curve end. |
|  | IsMirrored | States if the structural section of the element is mirrored. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Normal | The local Z direction of the element section in the start point of the curve. |
|  | Section | Structural section of the element. |
|  | StartShortening | Cutback or extension at element curve start. |
|  | YJust | Y justification (ref axis). |
|  | YOffset | Y offset. |
|  | ZJust | Z justification (ref axis). |
|  | ZOffset | Z offset. |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace